#include<iostream>
using namespace std;

int main()
{
    /*用户定义类型指的是实现抽象接口的类设计。*/
    /*指定基本类型完成三项工作：
    1、决定数据对象需要的内存数量
    2、决定如何解释内存中的位（long和float在内存中占用的位数相同，但将他们转换为数值的方法不同）
    3、决定可使用数据对象执行的操作或方法*/

    /*对于内置类型来说，有关操作的信息被内置到编译器中*/

    //C++中的类：
    /*定义：类是一种将对象转换为用户自定义类型的C++工具，它将数据和操纵数据的方法组合成一个整洁的包
      类规范：1、类声明：以数据成员的方式描述数据部分，以成员函数（被称为方法）的方式描述公有接口
              2、类方法定义：描述如何实现类成员函数
              类声明提供类的蓝图，类方法提供细节*/

              /*什么是接口：
              接口是一个共享框架，供两个系统交互时使用。程序接口将人的意图转换为存储在计算机中的具体信息*/

              /*对于类，我们常说公共接口。公众是使用类的程序，交互系统由类对象组成*/
    return 0;
}
