#include<iostream>
using namespace std;
int main()
{
	/*递增运算符有两种变体：x++和++x
	这两者的区别在于对操作数的影响的时间不同，结果是相同的，都是给x+1，下面的程序将
	说明区别*/
	int a = 20;
	int b = 20;
	cout << "a = " << a << ": b = " << b << "\n";
	cout << "a++ = " << a++ << ": ++b = " << ++b << "\n";
	cout << "a = " << a << ": b = " << b << "\n";
	/*a++意味着使用a当前的值计算表达式，然后将a的值加1；++b的意思是先将b的值加1，然后
	使用新的值来计算表达式，更容易理解的式子如下*/
	int x = 5;
	int y = ++x;/*先给x加1,然后将x的值赋给y，使得x=y=6*/

	int m = 5;
	int n = m++;/*先将m的值5赋给n，然后再给m加1，使得n=5，而m=6*/

	int k = 2 * k++ * (3 - ++k);/*在同一条语句中对同一个值递增或递减多次使得规则
								“使用后修改”和“修改后使用”变得模糊从而导致错误
								无法运行*/
	cout << k;
	return 0;
}