#include<iostream>
using namespace std;
const string month[3][12] = { {"第一年的一月","第一年的二月","第一年的三月","第一年的四月","第一年的五月","第一年的六月","第一年的七月","第一年的八月","第一年的九月","第一年的十月","第一年的十一月","第一年的十二月"},
							  {"第二年的一月","第二年的二月","第二年的三月","第二年的四月","第二年的五月","第二年的六月","第二年的七月","第二年的八月","第二年的九月","第二年的十月","第二年的十一月","第二年的十二月"},
							  {"第三年的一月","第三年的二月","第三年的三月","第三年的四月","第三年的五月","第三年的六月","第三年的七月","第三年的八月","第三年的九月","第三年的十月","第三年的十一月","第三年的十二月"} };
int sales_per_month[3][12];
int main()
{
	int m = 0;
	for (int i = 0; i <= 2; i++) {
		int y = 1;/*y决定第几年*/
		cout << "请输入第" << y << "年各月的销售量：" << endl;
		for (int x = 0; x <= 11; x++) {
			cout << "请输入" << month[i][x] << "的销售量：";
			cin >> sales_per_month[i][x];
		}
		y++;
	}/*用循环输入每月的销售量*/
	cout << "输入完成,三年共三十六个月的销售量如下：" << endl;
	int sum = 0;
	for (int x = 0; x <= 2; x++) {
		int y2 = 1;
		cout << "在第" << y2 << "年，十二个月的销售量如下：";
			for (int x2 = 0; x2 <= 11;x2++) {
				int x3 = 1;
				cout << x3 << "月的销售量为" << sales_per_month[x][x2];
					x3++;
		}
		x++;
	}
	cout << "三年的销售总量为：" << sum << "元。" << endl;
	return 0;
};